Revit 2027 API
FailureMessage.GetDescriptionText Method
 Retrieves the description text of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetDescriptionText()
Public Function GetDescriptionText As String
public:
String^ GetDescriptionText()
member GetDescriptionText : unit -> string
Return Value
String
 The description text.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace